---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TerminationExtensionLength
source: html/40d3741d-51ff-9471-653f-d66a665cbf1e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TerminationExtensionLength Property

"Extension Length"

## Syntax (C#)
```csharp
public static ForgeTypeId TerminationExtensionLength { get; }
```